// 1.Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа
// let input = +prompt("Введите число:");
// let number = parseFloat(input);
// let result = number * 0.1;
// console.log("10% от числа", number, "равно", result);
// 2.Написать программу, которая получает два числа и выводит наименьше

// Запросить у пользователя два числа
// let number1 = parseFloat(prompt("Введите первое число:"));
// let number2 = parseFloat(prompt("Введите второе число:"));
// let minNumber;

// if (number1 < number2) {
//   minNumber = number1;
// } else {
//   minNumber = number2;
// }
// console.log("Наименьшее число: " + minNumber);

// 3.Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’
// let number = +prompt("Введите число:");

// if (number < 100) {
//   console.log("Число меньше 100");
// } else if (number > 100) {
//   console.log("Число больше 100");
// } else {
//   console.log("Число равно 100");
// }


// 4.Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.


// const name = prompt("Введите ваше имя:");
// const age = +prompt("Введите ваш возраст (в годах):");
// if (age >= 18) {
//   console.log("Hello, " + name);
// } else {
//   console.log("Hi, " + name);
// }
